
#include "TimeInterval.h"

//u8	idata TX1_Buffer[COM_TX1_Lenth];	//发送缓冲
//u8 	idata RX1_Buffer[COM_RX1_Lenth];	//接收缓冲

extern T0_500MS2,T0_100MS10,T1_1MS1,T0_10MS2,MS3,T0_100MS1,T2_10MS2  ;  //其他文件定义的变量(外部变量)
extern u8 TaskUploadFlag;//任务3：数据上传任务
/**********************************************************************************/
//名称：void TimeInterval()
//功能：查询数据上报时间间隔
//参数： 
//返回值：返回值为控制定时器中断触发；void
//--------------------------------
//作者：XiongXiaoping 	
//修改日期：2020/05/09
//修改内容：设置从控板的主动上传数据的时间间隔
//----------------------------
/**********************************************************************************/
void TimeInterval()
{
	         u8 vt1=0;
	//         u8 i;

					if(MasterDataBuff[20]!=0x00)	//功能标志）
					{
				 if((MasterDataBuff[20]<=0x64))	//功能标志（控制上报时间快慢）
					{
            if( T0_500MS2)//100ms
						{ 
							vt1++;
							T0_500MS2=0;
							if(vt1>=(10*(u8)(MasterDataBuff[20])))
							{
							vt1=0;
							FramePacking(0x71,SlaveDataBuff);
							}
						 }					
					}
				}
				 		
}					


/**********************************************************************************/	
/**********************************************************************************/